---
kind: enumMember
id: F:Autodesk.Revit.DB.DataExchangeMessageId.UnitOfProgressCompleted
enum: Autodesk.Revit.DB.DataExchangeMessageId
source: html/f8f4737f-8c74-7c67-4669-ddddd2ccde1d.htm
---
# Autodesk.Revit.DB.DataExchangeMessageId.UnitOfProgressCompleted

That message will be sent at reasonable intervals to provide the using application an opportunity to update its progress indicator.